SerenityOS/serenity/Userland/Libraries/LibTLS/TLSRecord.cpp
/*
 * Copyright (c) 2023, stelar7 <dudedbz@gmail.com>
 *
 * SPDX-License-Identifier: BSD-2-Clause
 */

#include <AK/Debug.h>
#include <AK/Endian.h>
#include <AK/MemoryStream.h>
#include <LibCore/EventLoop.h>
#include <LibCore/Timer.h>
#include <LibCrypto/PK/Code/EMSA_PSS.h>
#include <LibTLS/Extensions.h>
#include <LibTLS/TLSRecord.h>
#include <LibTLS/TLSv12.h>

namespace TLS {

u16 TLSRecord::read_u16(ReadonlyBytes buffer, size_t offset)
{
    return AK::convert_between_host_and_network_endian(ByteReader::load16(buffer.offset_pointer(offset)));
}

Result<ByteBuffer, GenericError> TLSRecord::read_sized_buffer(size_t size, size_t offset, ReadonlyBytes buffer)
{
    if (offset + size > buffer.size()) {
        return GenericError::NeedMoreData;
    }

    auto maybe_buffer = ByteBuffer::create_uninitialized(size);
    if (maybe_buffer.is_error()) {
        return GenericError::OutOfMemory;
    }

    auto output = maybe_buffer.release_value();
    output.overwrite(0, buffer.slice(offset, size).data(), size);

    return output;
}

ErrorOr<String> TLSAlert::to_string(size_t indent)
{
    StringBuilder builder;

    builder.appendff("Alert:\n");
    builder.append(TRY(String::repeated('\t', indent + 1)));
    builder.appendff("Level: {}\n", enum_to_string(level));
    builder.append(TRY(String::repeated('\t', indent + 1)));
    builder.appendff("Description: {}\n", enum_to_string(description));
    builder.append(TRY(String::repeated('\t', indent + 2)));
    builder.appendff("{}\n", enum_to_value(description));

    return builder.to_string();
}

ErrorOr<NonnullRefPtr<TLSAlert>> TLSAlert::decode(ReadonlyBytes buffer)
{
    auto alert = TRY(try_make_ref_counted<TLSAlert>());
    alert->level = static_cast<AlertLevel>(AK::convert_between_host_and_network_endian(buffer[0]));
    alert->description = static_cast<AlertDescription>(AK::convert_between_host_and_network_endian(buffer[1]));
    return alert;
}

ErrorOr<ByteBuffer> TLSAlert::encode() { TODO(); }

ErrorOr<NonnullOwnPtr<TLSRecord>> TLSRecord::decode(ReadonlyBytes payload)
{
    size_t offset { 0 };

    // FIXME: Client message boundaries are not preserved in the record layer
    // (i.e.,multiple client messages of the same ContentType MAY be coalesced into a single TLSPlaintext record,
    // or a single message MAY be fragmented across several records).
    NonnullOwnPtr<TLSRecord> record = TRY(AK::try_make<TLSRecord>());
    record->content_type = static_cast<ContentType>(AK::convert_between_host_and_network_endian(payload[offset++]));
    record->protocol_version = static_cast<ProtocolVersion>(AK::convert_between_host_and_network_endian(ByteReader::load16(payload.offset_pointer(offset))));
    offset += 2;

    auto length = AK::convert_between_host_and_network_endian(ByteReader::load16(payload.offset_pointer(offset)));
    (void)length;
    offset += 2;

    ReadonlyBytes plain = payload;
    ByteBuffer decrypted;

    switch (record->content_type) {
    case ContentType::HANDSHAKE: {
        auto type = static_cast<HandshakeType>(AK::convert_between_host_and_network_endian(plain[offset]));

        switch (type) {
        case HandshakeType::HELLO_REQUEST_RESERVED: {
            auto content = TRY(HelloRequest::decode(plain.slice(offset, plain.size() - offset)));
            record->contents.append(content);
            break;
        }

        case HandshakeType::CLIENT_HELLO: {
            auto content = TRY(ClientHello::decode(plain.slice(offset, plain.size() - offset)));
            record->contents.append(content);
            break;
        }

        case HandshakeType::SERVER_HELLO: {
            auto content = TRY(ServerHello::decode(plain.slice(offset, plain.size() - offset)));
            record->contents.append(content);
            break;
        }

        case HandshakeType::CERTIFICATE: {
            auto content = TRY(HandshakeCertificate::decode(plain.slice(offset, plain.size() - offset)));
            record->contents.append(content);
            break;
        }

        case HandshakeType::SERVER_KEY_EXCHANGE_RESERVED: {
            /*
            auto algo = get_key_exchange_algorithm(cipher_suite);
            auto content = TRY(ServerKeyExchange::decode(plain.slice(offset, plain.size() - offset), algo));
            record->contents.append(content);
            */
            break;
        }

        case HandshakeType::SERVER_HELLO_DONE_RESERVED: {
            auto content = TRY(ServerHelloDone::decode(plain.slice(offset, plain.size() - offset)));
            record->contents.append(content);
            break;
        }

        default: {
            dbgln("Unable to handle handshake of type {}", enum_to_string(type));
            // TODO();
            break;
        }
        }
        break;
    }

    case ContentType::CHANGE_CIPHER_SPEC: {
        // We ignore this packet, since its not used.
        // TODO: Toggle on encryption
        break;
    }

    case ContentType::ALERT: {
        record->alert = TRY(TLSAlert::decode(plain.slice(offset, plain.size() - offset)));
        break;
    }

    default: {
        dbgln("Unable to handle TLSRecord of type {}", enum_to_string(record->content_type));
        // TODO();
        break;
    }
    }

    return record;
}

ErrorOr<ByteBuffer> TLSRecord::encode() { TODO(); }

ErrorOr<String> TLSRecord::to_string(size_t indent)
{
    StringBuilder builder;

    builder.append(TRY(String::repeated('\t', indent)));
    builder.appendff("TLSRecord:\n");
    builder.append(TRY(String::repeated('\t', indent + 1)));
    builder.appendff("Content Type: {}\n", enum_to_string(content_type));
    builder.append(TRY(String::repeated('\t', indent + 1)));
    builder.appendff("Protocol Version: {}\n", enum_to_string(protocol_version));

    if (alert) {
        builder.append(TRY(String::repeated('\t', indent + 1)));
        builder.appendff("{}", TRY(alert->to_string(indent + 1)));
    }

    builder.append(TRY(String::repeated('\t', indent + 1)));
    builder.appendff("Content:\n");

