SerenityOS/serenity/Userland/Libraries/LibTLS/TLSRecord.cpp
    for (auto& content : contents) {
        builder.append(TRY(content->to_string(indent + 2)));
    }

    return builder.to_string();
}

ErrorOr<NonnullRefPtr<HelloRequest>> HelloRequest::decode(ReadonlyBytes) { return AK::try_make_ref_counted<HelloRequest>(); }

ErrorOr<ByteBuffer> HelloRequest::encode()
{
    auto buffer = TRY(ByteBuffer::create_zeroed(4));
    buffer.append(static_cast<u8>(handshake_type));
    buffer.append(0);
    buffer.append(0);
    buffer.append(0);
    return buffer;
}

ErrorOr<String> HelloRequest::to_string(size_t indent)
{
    StringBuilder builder;

    builder.append(TRY(String::repeated('\t', indent)));
    builder.appendff("HelloRequest\n");

    return builder.to_string();
}

static ErrorOr<Vector<RefPtr<TLSExtension>>> parse_extensions(ReadonlyBytes buffer, size_t& offset)
{
    Vector<RefPtr<TLSExtension>> extensions;

    u16 extensions_length = TLSRecord::read_u16(buffer, offset);
    offset += sizeof(extensions_length);

    auto end_index = offset + extensions_length;

    while ((buffer.size() - offset) >= 4 && offset < end_index) {
        auto extension_type = static_cast<ExtensionType>(TLSRecord::read_u16(buffer, offset));
        u16 extension_length = TLSRecord::read_u16(buffer, offset + sizeof(ExtensionType));

        dbgln_if(TLS_DEBUG, "parsing extension: {}, expected bytes: {}, remaining bytes after parse: {}",
            enum_to_string(extension_type), extension_length, (i32)buffer.size() - offset - 4 - extension_length);

        switch (extension_type) {
        case ExtensionType::SERVER_NAME: {
            auto name_list = TRY(ServerNameList::decode(buffer.slice(offset, buffer.size() - offset)));
            extensions.append(name_list.release_nonnull());
            break;
        }
        case ExtensionType::EC_POINT_FORMATS: {
            auto points = TRY(ECPointFormats::decode(buffer.slice(offset, buffer.size() - offset)));
            extensions.append(points.release_nonnull());
            break;
        }
        case ExtensionType::SIGNATURE_ALGORITHMS: {
            auto points = TRY(SignatureSchemes::decode(buffer.slice(offset, buffer.size() - offset)));
            extensions.append(points.release_nonnull());
            break;
        }
        case ExtensionType::SUPPORTED_GROUPS: {
            auto points = TRY(SupportedGroups::decode(buffer.slice(offset, buffer.size() - offset)));
            extensions.append(points.release_nonnull());
            break;
        }

        default: {
            dbgln_if(TLS_DEBUG, "Encountered unknown extension {} with length {}", enum_to_string(extension_type), extension_length);
        }
        }
        offset += sizeof(extension_type) + sizeof(extension_length) + extension_length;
    }

    dbgln_if(TLS_DEBUG, "Handshake Extensions: parsing over, remaining bytes after parse: {}", (i32)buffer.size() - offset);

    return extensions;
}

ErrorOr<NonnullRefPtr<ClientHello>> ClientHello::decode(ReadonlyBytes buffer)
{
    auto type = static_cast<HandshakeType>(buffer[0]);
    VERIFY(type == HandshakeType::CLIENT_HELLO);

    size_t length = buffer[1] * 0x10000 + buffer[2] * 0x100 + buffer[3];
    if (buffer.size() < length) {
        return AK::Error::from_string_view(enum_to_string(GenericError::NeedMoreData));
    }

    size_t offset { 4 };
    auto client_hello = TRY(try_make_ref_counted<ClientHello>());

    client_hello->client_version = static_cast<ProtocolVersion>(TLSRecord::read_u16(buffer, offset));
    offset += sizeof(ProtocolVersion);

    memcpy(client_hello->client_random, buffer.offset_pointer(offset), sizeof(client_hello->client_random));
    offset += sizeof(client_hello->client_random);

    auto session_length = buffer[offset++];
    memcpy(client_hello->session_id, buffer.offset_pointer(offset), session_length);
    offset += session_length;

    u16 cipher_suite_length = TLSRecord::read_u16(buffer, offset);
    offset += sizeof(cipher_suite_length);

    auto cipher_suite_count = cipher_suite_length / 2;

    u16 cipher_index = 0;
    while (buffer.size() - offset >= 2 && cipher_index++ < cipher_suite_count) {
        client_hello->cipher_suites.append(static_cast<CipherSuite>(TLSRecord::read_u16(buffer, offset)));
        offset += sizeof(CipherSuite);
    }

    auto compression_method_length = buffer[offset++];
    u16 compression_method_index = 0;
    while (buffer.size() - offset >= 1 && compression_method_index++ < compression_method_length) {
        client_hello->compression_methods.append(static_cast<CompressionMethod>(buffer[offset++]));
    }

    client_hello->extensions = TRY(parse_extensions(buffer, offset));

    return client_hello;
}

ErrorOr<ByteBuffer> ClientHello::encode() { TODO(); }

ErrorOr<String> ClientHello::to_string(size_t indent)
{
    StringBuilder builder;

    builder.append(TRY(String::repeated('\t', indent)));
    builder.appendff("Server Hello:\n");
    builder.append(TRY(String::repeated('\t', indent + 1)));
    builder.appendff("Server version: {}\n", enum_to_string(client_version));
    builder.append(TRY(String::repeated('\t', indent + 1)));
    builder.appendff("Server random: {:hex-dump}\n", client_random);
    builder.append(TRY(String::repeated('\t', indent + 1)));
    builder.appendff("Session ID: {:hex-dump}\n", session_id);
    builder.append(TRY(String::repeated('\t', indent + 1)));
    builder.appendff("Cipher suits: {}\n", cipher_suites.size());
    for (auto& cipher : cipher_suites) {
        builder.append(TRY(String::repeated('\t', indent + 2)));
        builder.appendff("{}\n", enum_to_string(cipher));
    }
    builder.append(TRY(String::repeated('\t', indent + 1)));
    builder.appendff("Compression methods: {}\n", compression_methods.size());
    for (auto& compression : compression_methods) {
        builder.append(TRY(String::repeated('\t', indent + 2)));
        builder.appendff("{}\n", enum_to_string(compression));
    }
    builder.append(TRY(String::repeated('\t', indent + 1)));
    builder.appendff("Extensions: {}\n", extensions.size());
    for (auto& extension : extensions) {
        builder.append(TRY(extension->to_string(indent + 2)));
    }

    return builder.to_string();
}

ErrorOr<NonnullRefPtr<ServerHello>> ServerHello::decode(ReadonlyBytes buffer)
{
    auto type = static_cast<HandshakeType>(buffer[0]);
    VERIFY(type == HandshakeType::SERVER_HELLO);

    size_t length = buffer[1] * 0x10000 + buffer[2] * 0x100 + buffer[3];
    if (buffer.size() < length) {
        return AK::Error::from_string_view(enum_to_string(GenericError::NeedMoreData));
    }

    size_t offset { 4 };
    auto server_hello = TRY(try_make_ref_counted<ServerHello>());

    server_hello->server_version = static_cast<ProtocolVersion>(TLSRecord::read_u16(buffer, offset));
    offset += sizeof(ProtocolVersion);

    memcpy(server_hello->server_random, buffer.offset_pointer(offset), sizeof(server_hello->server_random));
    offset += sizeof(server_hello->server_random);

    auto session_length = buffer[offset++];
    memcpy(server_hello->session_id, buffer.offset_pointer(offset), session_length);
    offset += session_length;

