SerenityOS/serenity/Userland/Libraries/LibTLS/TLSRecord.cpp
    server_hello->cipher_suite = static_cast<CipherSuite>(TLSRecord::read_u16(buffer, offset));
    offset += sizeof(CipherSuite);

    if (!TLSv12::supports_cipher(server_hello->cipher_suite)) {
        dbgln_if(TLS_DEBUG, "No supported cipher could be agreed upon");
        return AK::Error::from_string_view(enum_to_string(GenericError::NoCommonCipher));
    }

    server_hello->compression_method = static_cast<CompressionMethod>(buffer[offset++]);
    if (server_hello->compression_method != CompressionMethod::NONE)
        return AK::Error::from_string_view(enum_to_string(GenericError::CompressionNotSupported));

    server_hello->extensions = TRY(parse_extensions(buffer, offset));

    return server_hello;
}

ErrorOr<ByteBuffer> ServerHello::encode() { TODO(); }

ErrorOr<String> ServerHello::to_string(size_t indent)
{
    StringBuilder builder;

    builder.append(TRY(String::repeated('\t', indent)));
    builder.appendff("Server Hello:\n");
    builder.append(TRY(String::repeated('\t', indent + 1)));
    builder.appendff("Server version: {}\n", enum_to_string(server_version));
    builder.append(TRY(String::repeated('\t', indent + 1)));
    builder.appendff("Server random: {:hex-dump}\n", server_random);
    builder.append(TRY(String::repeated('\t', indent + 1)));
    builder.appendff("Session ID: {:hex-dump}\n", session_id);
    builder.append(TRY(String::repeated('\t', indent + 1)));
    builder.appendff("Cipher suite: {}\n", enum_to_string(cipher_suite));
    builder.append(TRY(String::repeated('\t', indent + 1)));
    builder.appendff("Compression method: {}\n", enum_to_string(compression_method));
    builder.append(TRY(String::repeated('\t', indent + 1)));
    builder.appendff("Extensions: {}\n", extensions.size());
    for (auto& extension : extensions) {
        builder.append(TRY(extension->to_string(indent + 2)));
    }

    return builder.to_string();
}

ErrorOr<NonnullRefPtr<HandshakeCertificate>> HandshakeCertificate::decode(ReadonlyBytes buffer)
{
    size_t offset = { 0 };
    auto type = static_cast<HandshakeType>(buffer[offset++]);
    VERIFY(type == HandshakeType::CERTIFICATE);

    size_t extension_length = buffer[offset] * 0x10000 + buffer[offset + 1] * 0x100 + buffer[offset + 2];
    offset += 3;
    if (buffer.size() < extension_length) {
        return AK::Error::from_string_view(enum_to_string(GenericError::NeedMoreData));
    }

    size_t certificates_length = buffer[offset] * 0x10000 + buffer[offset + 1] * 0x100 + buffer[offset + 2];
    offset += 3;

    auto handshake_certificates = TRY(try_make_ref_counted<HandshakeCertificate>());
    while (offset < certificates_length - 7) {
        size_t certificate_size = buffer[offset] * 0x10000 + buffer[offset + 1] * 0x100 + buffer[offset + 2];
        offset += 3;

        auto certificate = TRY(Certificate::parse_certificate(buffer.slice(offset, certificate_size), false));
        handshake_certificates->certificates.append(certificate);
        offset += certificate_size;
    }

    return handshake_certificates;
}

ErrorOr<ByteBuffer> HandshakeCertificate::encode() { TODO(); }

ErrorOr<String> HandshakeCertificate::to_string(size_t indent)
{
    StringBuilder builder;

    for (auto& certificate : certificates) {
        builder.append(TRY(String::repeated('\t', indent)));
        builder.appendff("Handshake Certificate:\n");
        builder.append(TRY(String::repeated('\t', indent + 1)));
        builder.appendff("Version: {}\n", certificate.version);
        builder.append(TRY(String::repeated('\t', indent + 1)));
        builder.appendff("Serial Number: {}\n", TRY(certificate.serial_number.to_base(16)));
        builder.append(TRY(String::repeated('\t', indent + 1)));
        builder.appendff("Signature Algorithm: {}\n", to_underlying(certificate.algorithm));

        builder.append(TRY(String::repeated('\t', indent + 1)));
        builder.appendff("Validity:\n");
        builder.append(TRY(String::repeated('\t', indent + 2)));
        builder.appendff("Not Before: {}\n", TRY(certificate.validity.not_before.to_string()));
        builder.append(TRY(String::repeated('\t', indent + 2)));
        builder.appendff("Not After: {}\n", TRY(certificate.validity.not_after.to_string()));

        builder.append(TRY(String::repeated('\t', indent + 1)));
        builder.appendff("Issuer: {}\n", TRY(certificate.issuer.to_string()));
        builder.append(TRY(String::repeated('\t', indent + 1)));
        builder.appendff("Subject: {}\n", TRY(certificate.subject.to_string()));

        builder.append(TRY(String::repeated('\t', indent + 1)));
        builder.appendff("Subject Public Key Info:\n");
        builder.append(TRY(String::repeated('\t', indent + 2)));
        builder.appendff("Algorithm: {}\n", to_underlying(certificate.public_key.algorithm));
        switch (certificate.public_key.algorithm) {
        default:
            builder.append(TRY(String::repeated('\t', indent + 3)));
            builder.appendff("Public-Key: {:hex-dump}\n", certificate.public_key.raw_key.bytes());
            break;
        }
    }

    return builder.to_string();
}

ErrorOr<NonnullRefPtr<HandshakeCertificateVerify>> HandshakeCertificateVerify::decode(ReadonlyBytes) { TODO(); }
ErrorOr<ByteBuffer> HandshakeCertificateVerify::encode() { TODO(); }
ErrorOr<String> HandshakeCertificateVerify::to_string(size_t) { TODO(); }

static ErrorOr<ByteBuffer> decode_u8_buffer(ReadonlyBytes bytes, size_t& offset)
{
    u8 buffer_size = bytes[offset];
    offset += sizeof(u8);

    auto maybe_buffer = TLSRecord::read_sized_buffer(buffer_size, offset, bytes);
    if (maybe_buffer.is_error()) {
        return AK::Error::from_errno((i8)maybe_buffer.release_error());
    }

    offset += buffer_size;
    return maybe_buffer.release_value();
}

static ErrorOr<ByteBuffer> decode_u16_buffer(ReadonlyBytes bytes, size_t& offset)
{
    u16 buffer_size = AK::convert_between_host_and_network_endian(ByteReader::load16(bytes.offset_pointer(offset)));
    offset += sizeof(u16);

    auto maybe_buffer = TLSRecord::read_sized_buffer(buffer_size, offset, bytes);
    if (maybe_buffer.is_error()) {
        return AK::Error::from_string_view(enum_to_string(maybe_buffer.error()));
    }

    offset += buffer_size;
    return maybe_buffer.release_value();
}

