SerenityOS/serenity/Userland/Libraries/LibTLS/TLSRecord.cpp
static ErrorOr<CurveExchange> decode_curve_exchange(ReadonlyBytes buffer, size_t& offset)
{
    CurveExchange exchange;
    exchange.p = TRY(decode_u16_buffer(buffer, offset));
    exchange.g = TRY(decode_u16_buffer(buffer, offset));
    exchange.Ys = TRY(decode_u16_buffer(buffer, offset));
    return exchange;
}

static ErrorOr<ExplicitPrime> decode_explicit_prime(ReadonlyBytes buffer, size_t& offset)
{
    ExplicitPrime parameter;
    parameter.prime = TRY(decode_u8_buffer(buffer, offset));
    return parameter;
}

static ErrorOr<ExplicitChar> decode_explicit_char(ReadonlyBytes buffer, size_t& offset)
{
    ExplicitChar parameter;

    parameter.m = TLSRecord::TLSRecord::read_u16(buffer, offset);
    offset += sizeof(u16);

    auto basis = static_cast<ECBasisType>(AK::convert_between_host_and_network_endian(buffer[offset++]));
    if (basis == ECBasisType::EC_BASIS_TRINOMINAL) {
        ECTrinominal trinominal;
        trinominal.k = TRY(decode_u8_buffer(buffer, offset));
        parameter.basis = trinominal;
    } else if (basis == ECBasisType::EC_BASIS_PENTANOMINAL) {
        ECPentanominal pentanominal;
        pentanominal.k1 = TRY(decode_u8_buffer(buffer, offset));
        pentanominal.k2 = TRY(decode_u8_buffer(buffer, offset));
        pentanominal.k3 = TRY(decode_u8_buffer(buffer, offset));
        parameter.basis = pentanominal;
    } else {
        VERIFY_NOT_REACHED();
    }

    return parameter;
}

static ErrorOr<ECCurveExchange> decode_ec_curve_exchange(ReadonlyBytes buffer, size_t& offset)
{
    ECCurveExchange exchange;
    exchange.curve_type = static_cast<ECCurveType>(AK::convert_between_host_and_network_endian(buffer[offset]));
    offset += sizeof(ECCurveType);

    if (exchange.curve_type == ECCurveType::NAMED_CURVE) {
        exchange.curve_params = static_cast<SupportedGroup>(TLSRecord::read_u16(buffer, offset));
        offset += sizeof(SupportedGroup);
    } else {
        ECCurveParameters params;

        if (exchange.curve_type == ECCurveType::EXPLICIT_PRIME) {
            params.data = TRY(decode_explicit_prime(buffer, offset));
        } else if (exchange.curve_type == ECCurveType::EXPLICIT_CHAR2) {
            params.data = TRY(decode_explicit_char(buffer, offset));
        } else {
            VERIFY_NOT_REACHED();
        }

        params.curve.a = TRY(decode_u8_buffer(buffer, offset));
        params.curve.b = TRY(decode_u8_buffer(buffer, offset));
        params.base = TRY(decode_u8_buffer(buffer, offset));
        params.order = TRY(decode_u8_buffer(buffer, offset));
        params.cofactor = TRY(decode_u8_buffer(buffer, offset));

        exchange.curve_params = params;
    }

    return exchange;
}

static ErrorOr<void> decode_key_exchange_signature(ReadonlyBytes buffer, size_t& offset, ServerKeyExchange& server_key_exchange)
{
    server_key_exchange.signature_scheme = static_cast<SignatureScheme>(TLSRecord::read_u16(buffer, offset));
    offset += sizeof(SignatureScheme);

    server_key_exchange.signature = TRY(decode_u16_buffer(buffer, offset));
    return {};
}

ErrorOr<NonnullRefPtr<ServerKeyExchange>> ServerKeyExchange::decode(ReadonlyBytes buffer, KeyExchangeAlgorithm exchange_algorithm)
{
    auto type = static_cast<HandshakeType>(buffer[0]);
    VERIFY(type == HandshakeType::SERVER_KEY_EXCHANGE_RESERVED);

    size_t length = buffer[1] * 0x10000 + buffer[2] * 0x100 + buffer[3];
    if (buffer.size() < length) {
        return AK::Error::from_string_view(enum_to_string(GenericError::NeedMoreData));
    }

    size_t offset { 4 };
    auto server_key_exchange = TRY(try_make_ref_counted<ServerKeyExchange>());

    switch (exchange_algorithm) {
    // https://datatracker.ietf.org/doc/html/rfc5246#section-7.4.3
    case KeyExchangeAlgorithm::RSA:
    case KeyExchangeAlgorithm::DH_DSS:
    case KeyExchangeAlgorithm::DH_RSA: {
        break;
    }
    case KeyExchangeAlgorithm::DH_anon: {
        CurveExchange exchange = TRY(decode_curve_exchange(buffer, offset));
        server_key_exchange->public_key = exchange.Ys;
        server_key_exchange->exchange_parameters = exchange;
        break;
    }

    case KeyExchangeAlgorithm::DHE_DSS:
    case KeyExchangeAlgorithm::DHE_RSA: {
        CurveExchange exchange = TRY(decode_curve_exchange(buffer, offset));
        server_key_exchange->public_key = exchange.Ys;
        server_key_exchange->exchange_parameters = exchange;
        TRY(decode_key_exchange_signature(buffer, offset, server_key_exchange));
        break;
    }

    case KeyExchangeAlgorithm::ECDHE_RSA: {
        ECCurveExchange exchange = TRY(decode_ec_curve_exchange(buffer, offset));
        server_key_exchange->public_key = TRY(decode_u8_buffer(buffer, offset));
        server_key_exchange->exchange_parameters = exchange;
        TRY(decode_key_exchange_signature(buffer, offset, server_key_exchange));
        break;
    }

    default: {
        dbgln("Unhandled server key exchange algorithm, {}", enum_to_string(exchange_algorithm));
        VERIFY_NOT_REACHED();
        break;
    }
    }

    return server_key_exchange;
}

ErrorOr<ByteBuffer> ServerKeyExchange::encode() { TODO(); }

ErrorOr<String> ServerKeyExchange::to_string(size_t indent)
{
    StringBuilder builder;

    builder.append(TRY(String::repeated('\t', indent)));
    builder.appendff("Server Key Exchange:\n");

    TRY(exchange_parameters.visit(
        [](Empty) -> ErrorOr<void> {
            VERIFY_NOT_REACHED();
            return AK::Error::from_string_view("Empty exchange params"sv);
        },
        [&](CurveExchange exchange) -> ErrorOr<void> {
            builder.append(TRY(String::repeated('\t', indent + 1)));
            builder.appendff("Curve Exchange:\n");
            builder.append(TRY(String::repeated('\t', indent + 2)));
            builder.appendff("P: {:hex-dump}\n", exchange.p.bytes());
            builder.append(TRY(String::repeated('\t', indent + 2)));
            builder.appendff("G: {:hex-dump}\n", exchange.g.bytes());
            return {};
        },
        [&](ECCurveExchange exchange) -> ErrorOr<void> {
            builder.append(TRY(String::repeated('\t', indent + 1)));
            builder.appendff("EC Curve Exchange:\n");
            builder.append(TRY(String::repeated('\t', indent + 2)));
            builder.appendff("Curve Type: {}\n", enum_to_string(exchange.curve_type));
            TRY(exchange.curve_params.visit(
                [](Empty) -> ErrorOr<void> {
                    VERIFY_NOT_REACHED();
                    return AK::Error::from_string_view("Empty curve params"sv);
                },
                [&](SupportedGroup group) -> ErrorOr<void> {
                    builder.append(TRY(String::repeated('\t', indent + 2)));
                    builder.appendff("Curve Name: {}\n", enum_to_string(group));
                    return {};
                },
                [&](ECCurveParameters params) -> ErrorOr<void> {
                    (void)params;
                    builder.append(TRY(String::repeated('\t', indent + 2)));
                    builder.appendff("DUMP FOR ECCurveParameters not configured");
                    return {};
                }));
            return {};
        }));

    builder.append(TRY(String::repeated('\t', indent + 1)));
    builder.appendff("Public Key: {:hex-dump}\n", public_key.bytes());
    builder.append(TRY(String::repeated('\t', indent + 1)));
    builder.appendff("Signature Scheme: {}\n", enum_to_string(signature_scheme));
    builder.append(TRY(String::repeated('\t', indent + 1)));
    builder.appendff("Signature: {:hex-dump}\n", signature.bytes());

    return builder.to_string();
}

ErrorOr<NonnullRefPtr<ServerHelloDone>> ServerHelloDone::decode(ReadonlyBytes buffer)
{
    auto type = static_cast<HandshakeType>(buffer[0]);
    VERIFY(type == HandshakeType::SERVER_HELLO_DONE_RESERVED);

    size_t length = buffer[1] * 0x10000 + buffer[2] * 0x100 + buffer[3];
    if (buffer.size() < length) {
        return AK::Error::from_string_view(enum_to_string(GenericError::NeedMoreData));
    }

    return TRY(try_make_ref_counted<ServerHelloDone>());
}

ErrorOr<ByteBuffer> ServerHelloDone::encode()
{
    auto buffer = TRY(ByteBuffer::create_zeroed(4));
    buffer.append(static_cast<u8>(handshake_type));
    buffer.append(0);
    buffer.append(0);
    buffer.append(0);
    return buffer;
}

ErrorOr<String> ServerHelloDone::to_string(size_t indent)
{
    StringBuilder builder;

    builder.append(TRY(String::repeated('\t', indent)));
    builder.appendff("Server Hello Done");

    return builder.to_string();
}
}
